# 08_Casting
print('Hello from 08_Casting')


""" 변수에 특정 데이터 타입을 지정해야 할 때가 있습니다. 이는 형변환을 통해 가능합니다. 파이썬은 객체 지향 언어이므로, 기본 데이터 타입을 포함한 모든 데이터 타입을 클래스를 사용하여 정의합니다.

따라서 파이썬에서 형변환은 생성자 함수를 사용하여 수행됩니다.

int() - 정수 리터럴, 부동 소수점 리터럴(소수점 이하를 모두 제거), 또는 문자열 리터럴(문자열이 정수를 나타내는 경우)로부터 정수를 생성합니다.
float() - 정수 리터럴, 부동소수점 리터럴 또는 문자열 리터럴(단, 문자열이 부동소수점 또는 정수를 나타내는 경우)로부터 부동소수점 숫자를 생성합니다.
str() 함수는 문자열, 정수 리터럴, 부동 소수점 리터럴을 포함한 다양한 데이터 유형으로부터 문자열을 생성합니다. """


x = int(1)   # x will be 1
x = float(1)     # x will be 1.0
x = str("s1") # x will be 's1'

