# 04_Comments
print('Hello from 04_Comments')

# print()여러분은 이미 함수를 사용하여 텍스트를 표시하거나 값을 출력할 수 있다는 것을 배웠습니다 .
# print()이 함수는 원하는 만큼 여러 번 사용할 수 있습니다 . 기본적으로 호출할 때마다 텍스트가 새 줄에 출력됩니다.

print("I am", 25)


# 큰따옴표
# 파이썬에서 텍스트는 따옴표로 묶어야 합니다. "큰따옴표 또는 '작은따옴표를 사용할 수 있습니다.
# print("This will work!")
# print('This will also work!')
# 텍스트를 따옴표 안에 넣는 것을 잊으면 파이썬에서 오류가 발생합니다.
# 줄바꿈 없이 인쇄
# 기본적으로 이 print()함수는 줄 바꿈으로 끝납니다.

# 한 줄에 여러 단어를 출력하려면 다음 end매개변수를 사용할 수 있습니다.


# 주석은 # 이나 ''' 또는 """로 시작하여 여러 줄에 걸쳐 작성할 수 있습니다.

