# 01_Intro
print("""파이썬은 인기 있는 프로그래밍 언어입니다. 이 언어는 Guido van Rossum에 의해 만들어졌으며 1991년에 출시되었습니다.

다음 용도로 사용됩니다:
- 웹 개발(서버 측)
- 소프트웨어 개발
- 수학
- 시스템 스크립팅

파이썬은 무엇을 할 수 있나요?
- 파이썬은 서버에서 웹 애플리케이션을 만드는 데 사용할 수 있습니다.
- 파이썬은 소프트웨어와 함께 워크플로우를 생성하는 데 사용할 수 있습니다.
- 파이썬은 데이터베이스 시스템에 연결할 수 있습니다. 파일을 읽고 수정할 수도 있습니다.
- 파이썬은 빅데이터를 처리하고 복잡한 수학을 수행하는 데 사용할 수 있습니다.
- 파이썬은 빠른 프로토타이핑이나 생산 준비 소프트웨어 개발에 사용할 수 있습니다.

왜 파이썬인가요?
- 파이썬은 다양한 플랫폼(Windows, Mac, Linux, Raspberry Pi 등)에서 작동합니다.
- 파이썬은 영어와 유사한 간단한 구문을 가지고 있습니다.
- 파이썬은 개발자들이 다른 프로그래밍 언어보다 적은 줄로 프로그램을 작성할 수 있게 해주는 구문을 가지고 있습니다.
- 파이썬은 인터프리터 시스템에서 실행되므로 코드를 작성하는 즉시 실행할 수 있습니다. 즉, 프로토타이핑이 매우 빠를 수 있습니다.
- 파이썬은 절차적인 방식, 객체 지향적인 방식, 또는 기능적인 방식으로 처리될 수 있습니다.

알아두면 좋은 점.
- 파이썬의 최신 주요 버전은 파이썬 3이며, 이 튜토리얼에서 사용할 것입니다.
- 이 튜토리얼에서는 Python을 텍스트 편집기로 작성할 것입니다. 특히 대규모 Python 파일 컬렉션을 관리할 때 유용한 Thonny, Pycharm, Netbeans 또는 Eclipse와 같은 통합 개발 환경에서 Python을 작성할 수 있습니다.

다른 프로그래밍 언어와 비교한 파이썬 구문
- 파이썬은 가독성을 위해 설계되었으며, 수학의 영향을 받아 영어와 몇 가지 유사점이 있습니다.
- 파이썬은 세미콜론이나 괄호를 자주 사용하는 다른 프로그래밍 언어와 달리 명령어를 완성하기 위해 새로운 줄을 사용합니다.
- 파이썬은 루프, 함수 및 클래스의 범위와 같은 범위를 정의하기 위해 공백을 사용하는 들여쓰기에 의존합니다. 다른 프로그래밍 언어들은 종종 이 목적을 위해 컬리브래킷을 사용합니다.""")

