# 03_Syntax
print('Hello from 03_Syntax')

if 5 > 2: print("five is greater then two")

#파이썬에서 세미콜론은 선택 사항입니다. 
# 세미콜론으로 구분하여 여러 문장을 한 줄에 작성할 수 있지만 ;, 
# 가독성이 떨어지기 때문에 거의 사용되지 않습니다.


print("Hello"); print("How are you?"); print("Bye bye!")
#하지만 구분자(줄 바꿈 또는 쉼표 ;) 없이 같은 줄에 두 개의 문장을 입력하면
#  파이썬은 오류를 발생시킵니다.

# 들여쓰기는 최소 1개를 요구하지만 일반적으로 4개 쓰며 최소 1개임
# 같은 코드 블록 내에서는 동일한 개수의 공백 사용해야함 중요

x = 5
y = "Hello, World!"
# 변수 지정시 따로 명령어가 없음

#파이썬은 코드 내 문서화를 위해 주석 기능을 제공합니다.

#주석은 쉼표( #,)로 시작하며, 파이썬은 나머지 줄을 주석으로 렌더링합니다.